Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Most of the time they have a sprite associated with them so that you see them in the game rooms, but sometimes they are used as a "behind the scenes" controller to do things related to the user or for timing, etc...
zh_cn: 大多数时候他们有一个与他们相关的精灵，以便您在游戏室看到他们，但有时候它们被用作“幕后”控制器来做与用户相关的事情或时间等...

source: Motors
zh_cn: 动力

source: Mouse
zh_cn: 鼠标

source: Mouse & Key Selector
zh_cn: 鼠标 & 按键选择器

source: Mouse & Keyboard
zh_cn: 鼠标和键盘

source: Mouse Click
zh_cn: 鼠标单击

source: Mouse Down
zh_cn: 压住鼠标

source: Mouse Enter
zh_cn: 鼠标移入

source: Mouse Leave
zh_cn: 鼠标移出

source: Mouse Up
zh_cn: 松开鼠标

source: Mouse Wheel Down
zh_cn: 鼠标滚轮向下滚动

source: Mouse Wheel Up
zh_cn: 鼠标滚轮向上滚动

source: Mouse down time to start dragging node (ms)
zh_cn: 鼠标按下到开始拖动节点所需的时间(毫秒)

source: Mouse event
zh_cn: 鼠标事件

source: Mouse wheel zoom requires ${ctrl} key
zh_cn: 鼠标滚轮缩放需要 ${ctrl} 键

source: Mouseover anchor point colour
zh_cn: 鼠标悬停的锚点颜色

source: Mouseover invalid anchor point colour
zh_cn: 鼠标悬停的无效锚点颜色

source: Mouseover tile highlight colour
zh_cn: 鼠标悬停图块高亮颜色

source: Move Column Left
zh_cn: 向左移动列

source: Move Column Right
zh_cn: 向右移动列

source: Move Menu Item Down
zh_cn: 下移菜单项

source: Move Menu Item Up
zh_cn: 上移菜单项

source: Move Node Down
zh_cn: 下移节点

source: Move Node Up
zh_cn: 上移节点

source: Move Row Down
zh_cn: 向下移动行

source: Move Row Up
zh_cn: 向上移动行

source: Move Tab '{0}' Back
zh_cn: 向后移动选项卡'{0}'

source: Move Tab '{0}' Forward
zh_cn: 向前移动选项卡'{0}'

source: Move To
zh_cn: 移动到

source: Move focused window to top
zh_cn: 将焦点窗口移至顶部

source: Move it to a correct location.
zh_cn: 请将它移动到正确的位置。

source: Move selected items down
zh_cn: 下移所选项目

source: Move selected items left
zh_cn: 左移所选项目

source: Move selected items right
zh_cn: 右移所选项目

source: Move selected items up
zh_cn: 上移所选项目

source: Move selected pixels 1pixel down
zh_cn: 将所选像素向下移动1像素

source: Move selected pixels 1pixel left
zh_cn: 将所选像素向左移动1像素

source: Move selected pixels 1pixel right
zh_cn: 将所选像素向右移动1像素

source: Move selected pixels 1pixel up
zh_cn: 将所选像素向上移动1像素

source: Move the current animation frame left
zh_cn: 左移当前动画帧

source: Move the current animation frame right
zh_cn: 右移当前动画帧

source: Move the current animation set down
zh_cn: 下移当前动画集

source: Move the current animation set up
zh_cn: 上移当前动画集

source: Move to Top
zh_cn: 移至顶部

source: Move to the next window down
zh_cn: 移至邻近窗口下方

source: Move to the next window down and left
zh_cn: 移至邻近窗口左下方

source: Move to the next window down and right
zh_cn: 移至邻近窗口右下方

source: Move to the next window left
zh_cn: 移至邻近窗口左侧

source: Move to the next window right
zh_cn: 移至邻近窗口右侧

source: Move to the next window up
zh_cn: 移至邻近窗口上方

source: Move to the next window up and left
zh_cn: 移至邻近窗口左上方

source: Move to the next window up and right
zh_cn: 移至邻近窗口右上方

source: Movement
zh_cn: 移动

source: Movement and Collisions
zh_cn: 移动和碰撞

source: Much easier to keep track of one array than multiple variables.
zh_cn: 跟踪一个数组比多个变量容易得多。

source: Multi-select
zh_cn: 多选

source: Multiline Text Box
zh_cn: 多行文本框

source: Multiple layouts with name '{0}' specify with guid to ensure correct selection
zh_cn: 有多个布局名称为 '{0}' ，请指定guid(?)以确保正确的选择

source: Multiply
zh_cn: 相乘

source: Mute all sounds in group
zh_cn: 组中所有声音静音

source: Mute sound
zh_cn: 静音

source: My Account
zh_cn: 我的帐户

source: My Code
zh_cn: 我的代码

source: My Library
zh_cn: 我的库

source: My Purchase History
zh_cn: 我的购买历史

source: NOT INSTALLED
zh_cn: 未安装

source: NSIS Script
zh_cn: NSIS 脚本

source: NSWindow class
zh_cn: NSWindow类

source: Name
zh_cn: 名称

source: Name And Icon
zh_cn: 名称和图标

source: Name and Password fields must be set
zh_cn: 必须设置名称和密码字段

source: Name of Folder
zh_cn: 文件夹名称

source: Name/IP
zh_cn: 名称/IP

source: Name/IP is invalid.
zh_cn: 名称/IP无效。

source: Name:
zh_cn: 名称：

source: Names must be unique and not empty
zh_cn: 名称必须唯一且不为空

source: Names must be unique.
zh_cn: 名称必须是唯一的。

source: Native CPU Target
zh_cn: 本机CPU目标平台

source: Navigating The Workspace
zh_cn: 浏览工作区

source: Network Buffers
zh_cn: 网络缓冲区

source: Network Manifest
zh_cn: 联网清单

source: Network URLs
zh_cn: 网络地址

source: Networking
zh_cn: 联网

source: Never
zh_cn: 从不

source: New
zh_cn: 新建

source: New Action
zh_cn: 新建动作

source: New Canvas Size:
zh_cn: 新的画布大小

source: New Colour
zh_cn: 新的颜色

source: New Configuration Name
zh_cn: 新的配置名称

source: New Event
zh_cn: 新事件

source: New IDE
zh_cn: 新的IDE

source: New Language
zh_cn: 新的语言

source: New Layout
zh_cn: 新布局

source: New Library
zh_cn: 新建库

source: New Name
zh_cn: 新名称

source: New Node
zh_cn: 新建节点

source: New Project
zh_cn: 新建项目

source: New Project (${show_new_projects_page})
zh_cn: 新项目 (${show_new_projects_page})

source: New Project (CTRL + N)
zh_cn: 新的项目 (CTRL + N)

source: New Section
zh_cn: 新建节(?)

source: New Sprite
zh_cn: 新的精灵

source: New Version
zh_cn: 新版本

source: New Version ({0})
zh_cn: 新版本 ({0})

source: New Version Window
zh_cn: 新版本窗口

source: New Version:
zh_cn: 新版本：

source: New configuration name cannot be empty
zh_cn: 新配置名称不能为空

source: New game data downloaded from the cloud (following a cloud_synchronise call)
zh_cn: 从云端下载新的游戏数据(在 cloud_synchronise后调用)。

source: New version is available!
zh_cn: 新版本可用！

source: News
zh_cn: 新闻

source: Next
zh_cn: 下一个

source: Next Page
zh_cn: 下一页

source: Next Region
zh_cn: 下一区域

source: Next frame
zh_cn: 下一帧

source: Next is the User Identity section with the following fields which are required to be filled in:
zh_cn: 接下来是 用户标识 部分，其中需要填写以下字段：

source: Next it is compared with the results of the different expressions after each of the case statements.
zh_cn: 下一步与case后面的表达式的结果进行比较。

source: Next you can choose the sprite for the object should you wish it to have one.
zh_cn: 接下来你可以选择你想要的物体的精灵。

source: Next you can open the Recent Windows list, and there is also the option to open the Environment Variables window where you can see the different paths that the various environment variables used in the Preferences point to.
zh_cn: 接下来，您可以打开 最近窗口 列表，还可以打开 环境变量 窗口，在其中可以看到“首选项”中指向的各种环境变量的不同路径。

source: Next: Accessors
zh_cn: 下一页：访问器

source: Next: Action Scripts
zh_cn: 下一页：动作脚本

source: Next: Additional Information
zh_cn: 上一页：附加信息

source: Next: Addressing Variables in Other Instances
zh_cn: 下一页：访问其它实例的变量

source: Next: Applying Actions To Other Instances
zh_cn: 下一页：将动作应用于其他实例

source: Next: Arrays
zh_cn: 下一页：数组

source: Next: Assignments
zh_cn: 下一页：赋值

source: Next: Async Events
zh_cn: 下一页：异步事件

source: Next: Basic Code Structure
zh_cn: 下一页：基本代码结构

source: Next: Bitwise Operators
zh_cn: 下一页：二进制运算符

source: Next: Changing Drag And Drop To Code
zh_cn: 下一页：拖拽按钮转换为代码

source: Next: Command Line Parameters
zh_cn: 下一页：命令行参数

source: Next: Comments in Code
zh_cn: 下一页： 代码注释

source: Next: Compiler Errors
zh_cn: 下一页：编译错误

source: Next: Compiling
zh_cn: 下一页：编译

source: Next: Configurations
zh_cn: 上一页：配置

source: Next: Constructing Action Block Code
zh_cn: 下一页：构造动作代码块

source: Next: Creating Objects
zh_cn: 下一页：创建物体

source: Next: Creating Rooms
zh_cn: 下一页：创建房间

source: Next: Creating Sounds
zh_cn: 下一页：创建声音

source: Next: Creating Tile sets
zh_cn: 下一页：创建图块组

source: Next: Data Types
zh_cn: 下一页：数据类型

source: Next: Date And Time
zh_cn: 下一页：日期和时间

source: Next: Debugging
zh_cn: 下一页：调试

source: Next: Drag And Drop Reference
zh_cn: 下一页：拖拽按钮参考

source: Next: Drag and Drop
zh_cn: 下一页：拖拽按钮

source: Next: Draw Events
zh_cn: 下一页：绘制事件

source: Next: Editors
zh_cn: 下一页： 编辑器

source: Next: Evaluation Order
zh_cn: 下一个：求值顺序

source: Next: Expressions
zh_cn: 下一页：表达式

source: Next: Extension Editor
zh_cn: 下一节：扩展编辑器

source: Next: Extensions
zh_cn: 下一页：扩展

source: Next: Functions
zh_cn: 下一页：函数

source: Next: GameMaker Studio 2 Versions
zh_cn: 下一页：GameMaker Studio 2 版本

source: Next: General Preferences
zh_cn: 下一页：常规设定

source: Next: Gesture Events
zh_cn: 下一页：手势事件

source: Next: IDE Input
zh_cn: 下一页：IDE输入

source: Next: Image Editor
zh_cn: 下一页：图像编辑器

source: Next: Importing Non-Bitmap Sprites
zh_cn: 下一页：导入非位图精灵

source: Next: In App Purchases
zh_cn: 下一页：应用内购

source: Next: Included Files
zh_cn: 下一页：内含文件

source: Next: Installing
zh_cn: 下一页： 安装

source: Next: Instances
zh_cn: 下一页：实例

source: Next: Introduction
zh_cn: 下一页：介绍

source: Next: JSDoc
zh_cn: 下一页：JSDoc

source: Next: Keywords
zh_cn: 下一页：关键字

source: Next: Language Features
zh_cn: 下一页：语言特性

source: Next: Languages
zh_cn: 下一页： 语言

source: Next: Licensing
zh_cn: 下一页：授权

source: Next: Loop Actions
zh_cn: 上一页：循环动作

source: Next: Marketplace
zh_cn: 下一页：市场

source: Next: Micro Web Server
zh_cn: 下一页：微型网络服务器

source: Next: Normalised Vectors
zh_cn: 下一页：规格化向量

source: Next: Object Editor
zh_cn: 下一页：物体编辑器

source: Next: Obsolete Functions
zh_cn: 下一页：弃用函数

source: Next: Paths
zh_cn: 下一章: 路径

source: Next: Plugins
zh_cn: 下一页： 插件

source: Next: Quick Start Guide
zh_cn: 下一页：快速入门向导

source: Next: Release Notes
zh_cn: 下一页：发行信息

source: Next: Required SDKs
zh_cn: 下一页：必需的SDKs

source: Next: Resource Tree
zh_cn: 下一节：资源树

source: Next: Resources
zh_cn: 下一页：资源

source: Next: Room Editor
zh_cn: 下一页： 房间编辑器

source: Next: Runtimes
zh_cn: 下一页：运行库

source: Next: Scripts
zh_cn: 下一页：脚本

source: Next: Settings
zh_cn: 下一页：设置

source: Next: Simple Particle Effects
zh_cn: 下一页：简单粒子特效

source: Next: Soft Body Particles
zh_cn: 下一页：柔体粒子

source: Next: Spline Editor
zh_cn: 下一页：样条曲线编辑器

source: Next: Sprite Editor
zh_cn: 下一页：精灵编辑器

source: Next: Text Editor
zh_cn: 下一页：文本编辑器

source: Next: Texture Pages
zh_cn: 下一页：纹理页

source: Next: The Build Menu
zh_cn: 下一页：构建菜单

source: Next: The Edit Menu
zh_cn: 下一页：编辑菜单

source: Next: The File Menu
zh_cn: 下一页：文件菜单

source: Next: The File System
zh_cn: 下一页：文件系统

source: Next: The Help Menu
zh_cn: 下一页：帮助菜单

source: Next: The Layouts Menu
zh_cn: 下一页：布局菜单

source: Next: The Marketplace Menu
zh_cn: 下一页：市场菜单

source: Next: The Room Editor
zh_cn: 下一页：房间编辑器

source: Next: The Sprite Editor
zh_cn: 下一页：精灵编辑器

source: Next: The Start Page
zh_cn: 下一页 The Start Page

source: Next: The Tile Set Editor
zh_cn: 下一页：图块集编辑器

source: Next: The Timeline Editor
zh_cn: 下一页：时间轴编辑器

source: Next: The Tools Menu
zh_cn: 下一页：工具菜单

source: Next: The Windows Menu
zh_cn: 下一页： 窗口菜单

source: Next: Tileset Editor
zh_cn: 下一节： 图块集编辑器

source: Next: Tools
zh_cn: 下一页：工具

source: Next: Updating
zh_cn: 下一页：更新

source: Next: Using Buffers
zh_cn: 下一页：使用缓冲区

source: Next: Variables And Variable Scope
zh_cn: 下一页：变量与变量作用域

source: Next: Workflow
zh_cn: 下一页：工作流程

source: Next: Workspaces
zh_cn: 下一页：工作区

source: Next: application_get_position
zh_cn: 下一页: application_get_position

source: Next: application_surface
zh_cn: 下一页: application_surface

source: Next: application_surface_draw_enable
zh_cn: 下一页: application_surface_draw_enable

source: Next: application_surface_enable
zh_cn: 下一页: application_surface_enable

source: Next: application_surface_is_enabled
zh_cn: 下一页: application_surface_is_enabled

source: Next: array_copy
zh_cn: 下一页：array_copy

source: Next: array_create
zh_cn: 下一页：array_create

source: Next: array_equals
zh_cn: 下一页：array_equals

source: Next: array_height_2d
zh_cn: 下一页：array_height_2d

source: Next: array_length_1d
zh_cn: 下一页：array_length_1d

source: Next: array_length_2d
zh_cn: 下一页：array_length_2d

source: Next: async_load
zh_cn: 下一页：async_load

source: Next: colour_get_green
zh_cn: 下一页：colour_get_green

source: Next: colour_get_red
zh_cn: 下一页：colour_get_red

source: Next: colour_get_saturation
zh_cn: 下一页：colour_get_saturation

source: Next: display_get_dpi_x
zh_cn: 下一页: display_get_dpi_x

source: Next: display_get_dpi_y
zh_cn: 下一页: display_get_dpi_y

source: Next: display_get_gui_height
zh_cn: 下一页: display_get_gui_height

source: Next: display_get_gui_width
zh_cn: 下一页t: display_get_gui_width

source: Next: display_get_height
zh_cn: 下一页: display_get_height

source: Next: display_get_orientation
zh_cn: 下一章: display_get_orientation

source: Next: display_get_width
zh_cn: 下一页: display_get_width

source: Next: display_get_windows_alternate_sync
zh_cn: 下一页: display_get_windows_alternate_sync

source: Next: display_get_windows_vertex_buffer_method
zh_cn: 下一页: display_get_windows_vertex_buffer_method

source: Next: display_mouse_get_y
zh_cn: 下一页: display_mouse_get_y

source: Next: display_reset
zh_cn: 下一页: display_reset

source: Next: display_set_gui_maximise
zh_cn: 下一页: display_set_gui_maximise

source: Next: display_set_gui_size
zh_cn: 下一页: display_set_gui_size

source: Next: display_set_windows_alternate_sync
zh_cn: 下一页: display_set_windows_alternate_sync

source: Next: ds_grid_add_disk
zh_cn: 下一个： ds_grid_add_disk

source: Next: ds_grid_add_grid_region
zh_cn: 下一页： ds_grid_add_grid_region

source: Next: ds_grid_add_region
zh_cn: 下一页： ds_grid_add_region

source: Next: ds_grid_multiply
zh_cn: 下一页： ds_grid_multiply

source: Next: ds_grid_read
zh_cn: 下一页： ds_grid_read

source: Next: ds_grid_set
zh_cn: 下一页： ds_grid_set

source: Next: event_action
zh_cn: 下一页：event_action

source: Next: event_inherited
zh_cn: 下一页：event_inherited

source: Next: event_number
zh_cn: 下一页：event_number

source: Next: event_object
zh_cn: 下一页：event_object

source: Next: event_perform
zh_cn: 下一页：event_perform

source: Next: event_perform_object
zh_cn: 下一页：event_perform_object

source: Next: event_type
zh_cn: 下一页：event_type

source: Next: event_user
zh_cn: 下一页：event_user

source: Next: font_add
zh_cn: 下一页：font_add

source: Next: font_add_sprite
zh_cn: 下一页：font_add_sprite

source: Next: font_add_sprite_ext
zh_cn: 下一页：font_add_sprite_ext

source: Next: font_get_bold
zh_cn: 下一页：font_get_bold

source: Next: font_get_first
zh_cn: 下一页：font_get_first

source: Next: font_get_last
zh_cn: 下一页：font_get_last

source: Next: font_get_size
zh_cn: 下一页：font_get_size

source: Next: font_replace_sprite
zh_cn: 下一页：font_replace_sprite

source: Next: font_texture_page_size
zh_cn: 下一页：font_texture_page_size

source: Next: health
zh_cn: 下一页：health

source: Next: lives
zh_cn: 下一页：lives

source: Next: matrix_build
zh_cn: 下一页：matrix_build

source: Next: matrix_build_identity
zh_cn: 下一页：matrix_build_identity

source: Next: matrix_build_lookat
zh_cn: 下一页：matrix_build_lookat

source: Next: matrix_build_projection_ortho
zh_cn: 下一页：matrix_build_projection_ortho

source: Next: matrix_build_projection_perspective
zh_cn: 下一页：matrix_build_projection_perspective

source: Next: matrix_build_projection_perspective_fov
zh_cn: 下一页：matrix_build_projection_perspective_fov

source: Next: matrix_multiply
zh_cn: 下一页：matrix_multiply

source: Next: matrix_set
zh_cn: 下一页：matrix_set

source: Next: matrix_stack_clear
zh_cn: 下一页： matrix_stack_clear

source: Next: matrix_stack_set
zh_cn: 下一页：matrix_stack_set

source: Next: matrix_transform_vertex
zh_cn: 下一页：matrix_transform_vertex

source: Next: network_connect
zh_cn: 下一页：network_connect

source: Next: network_connect_raw
zh_cn: 下一页：network_connect_raw

source: Next: network_create_server
zh_cn: 下一页：network_create_server

source: Next: network_create_server_raw
zh_cn: 下一页：network_create_server_raw

source: Next: network_create_socket
zh_cn: 下一页：network_create_socket

source: Next: network_create_socket_ext
zh_cn: 下一页：network_create_socket_ext

source: Next: network_destroy
zh_cn: 下一页：network_destroy

source: Next: network_resolve
zh_cn: 下一页：network_resolve

source: Next: network_send_broadcast
zh_cn: 下一页：network_send_broadcast

source: Next: network_send_packet
zh_cn: 下一页：network_send_packet

source: Next: network_send_udp_raw
zh_cn: 下一页：network_send_udp_raw

source: Next: network_set_config
zh_cn: 下一页：network_set_config

source: Next: network_set_timeout
zh_cn: 下一页：network_set_timeout

source: Next: obj_get_mask
zh_cn: 下一页：obj_get_mask

source: Next: object_get_mask
zh_cn: 下一页：object_get_mask

source: Next: object_is_ancestor
zh_cn: 下一页：object_is_ancestor

source: Next: part_emitter_clear
zh_cn: 下一页：part_emitter_clear

source: Next: part_emitter_destroy_all
zh_cn: 下一页：part_emitter_destroy_all

source: Next: part_emitter_exists
zh_cn: 下一页：part_emitter_exists

source: Next: part_emitter_region
zh_cn: 下一页：part_emitter_region

source: Next: part_emitter_stream
zh_cn: 下一页：part_emitter_stream

source: Next: physics_joint_enable_motor
zh_cn: 下一页：physics_joint_enable_motor

source: Next: point_direction
zh_cn: 下一页: point_direction

source: Next: push_cancel_local_notification
zh_cn: 下一页： push_cancel_local_notification

source: Next: push_get_first_local_notification
zh_cn: 下一页： push_get_first_local_notification

source: Next: push_get_next_local_notification
zh_cn: 下一页： push_get_next_local_notification

source: Next: push_local_notification
zh_cn: 下一页: push_local_notification

source: Next: score
zh_cn: 下一页：score

source: Next: screen_save
zh_cn: 下一页: screen_save

source: Next: screen_save_part
zh_cn: 下一页: screen_save_part

source: Next: surface_copy
zh_cn: 下一页: surface_copy

source: Next: surface_copy_part
zh_cn: 下一页: surface_copy_part

source: Next: surface_create
zh_cn: 下一页: surface_create

source: Next: surface_create_ext
zh_cn: 下一页: surface_create_ext

source: Next: surface_exists
zh_cn: 下一页: surface_exists

source: Next: surface_free
zh_cn: 下一页: surface_free

source: Next: surface_get_height
zh_cn: 下一页: surface_get_height

source: Next: surface_get_texture
zh_cn: 下一页: surface_get_texture

source: Next: surface_get_width
zh_cn: 下一页: surface_get_width

source: Next: surface_getpixel
zh_cn: 下一页: surface_getpixel

source: Next: surface_getpixel_ext
zh_cn: 下一页: surface_getpixel_ext

source: Next: surface_reset_target
zh_cn: 下一页: surface_reset_target

source: Next: surface_resize
zh_cn: 下一页: surface_resize

source: Next: surface_save
zh_cn: 下一页: surface_save

source: Next: surface_save_part
zh_cn: 下一页: surface_save_part

source: Next: surface_set_target
zh_cn: 下一页: surface_set_target

source: Next: surface_set_target_ext
zh_cn: 下一页: surface_set_target_ext

source: Next: variable_global_get
zh_cn: 下一页：variable_global_get

source: Next: variable_global_set
zh_cn: 下一页：variable_global_set

source: Next: variable_instance_exists
zh_cn: 下一页：variable_instance_exists

source: Next: view_current
zh_cn: 下一页 view_current

source: Next: view_enabled
zh_cn: 下一页: view_enabled

source: Next: view_hport
zh_cn: 下一页: view_hport

source: Next: view_surface_id
zh_cn: 下一页: view_surface_id

source: Next: view_visible
zh_cn: 下一页: view_visible

source: Next: view_wport
zh_cn: 下一页: view_wport

source: Next: view_xport
zh_cn: 下一页: view_xport

source: Next: view_yport
zh_cn: 下一页: view_yport

source: Next: window_center
zh_cn: 下一页：window_center

source: Next: window_device
zh_cn: 下一页：window_device

source: Next: window_get_caption
zh_cn: 下一页：window_get_caption

source: Next: window_get_colour
zh_cn: 下一页: window_get_colour

source: Next: window_get_cursor
zh_cn: 下一页: window_get_cursor

source: Next: window_get_fullscreen
zh_cn: 下一页: window_get_fullscreen

source: Next: window_get_height
zh_cn: 下一页: window_get_height

source: Next: window_get_visible_rects
zh_cn: 下一页: window_get_visible_rects

source: Next: window_get_width
zh_cn: 下一页: window_get_width

source: Next: window_get_x
zh_cn: 下一页: window_get_x

source: Next: window_get_y
zh_cn: 下一页: window_get_y

source: Next: window_handle
zh_cn: 下一页: window_handle

source: Next: window_has_focus
zh_cn: 下一页: window_has_focus

source: Next: window_mouse_get_x
zh_cn: 下一页: window_mouse_get_x

source: Next: window_mouse_get_y
zh_cn: 下一页：window_mouse_get_y

source: Next: window_set_caption
zh_cn: 下一页：window_set_caption

source: Next: window_set_colour
zh_cn: 下一页: window_set_colour

source: Next: window_set_cursor
zh_cn: 下一页: window_set_cursor

source: Next: window_set_fullscreen
zh_cn: 下一页: window_set_fullscreen

source: Next: window_set_max_height
zh_cn: 下一页: window_set_max_height

source: Next: window_set_max_width
zh_cn: 下一页: window_set_max_width

source: Next: window_set_min_height
zh_cn: 下一页: window_set_min_height

source: Next: window_set_min_width
zh_cn: 下一页: window_set_min_width

source: Next: window_set_position
zh_cn: 下一页: window_set_position

source: Next: window_set_rectangle
zh_cn: 下一页: window_set_rectangle

source: Next: window_set_size
zh_cn: 下一页: window_set_size

source: Next: window_view_mouse_get_x
zh_cn: 下一页: window_view_mouse_get_x

source: Next: window_view_mouse_get_y
zh_cn: 下一页 window_view_mouse_get_y

source: Next: window_views_mouse_get_x
zh_cn: 下一页: window_views_mouse_get_x

source: Next: window_views_mouse_get_y
zh_cn: 下一页: window_views_mouse_get_y

source: NintendoSDK Directory
zh_cn: NintendoSDK 目录

source: No
zh_cn: 否

source: No Action
zh_cn: 没有动作

source: No Amazon devices detected
zh_cn: 未检测到亚马逊设备

source: No Architectures have been specified in the Android Options
zh_cn: Android 选项中未指定任何架构

source: No Audio Device
zh_cn: 没有音频设置

source: No Button
zh_cn: 无鼠标键

source: No Devices found
zh_cn: 没有发现设备

source: No Image Selected
zh_cn: 未选择图像

source: No Key
zh_cn: 无键位

source: No Keystore has been set in the Amazon Fire Preferences
zh_cn: Amazon Fire 偏好设置中未设置密钥库

source: No Keystore has been set in the Android Preferences
zh_cn: Android 偏好设置中未设置密钥库

source: No Mouse Input
zh_cn: 无鼠标输入

source: No NMeta file has been found for this project.
zh_cn: 找不到此项目的NMeta文件。

source: No Object
zh_cn: 没有物体

source: No Parent
zh_cn: 没有父物体

source: No Publisher selected
zh_cn: 没有选中发布者

source: No SSH Keypair authentication details found for {0}
zh_cn: 未找到{0}的 SSH 密钥对 身份验证详细信息

source: No Sound has been loaded
zh_cn: 没有加载声音

source: No Split
zh_cn: 不拆分

source: No Sprite
zh_cn: 没有精灵

source: No Sprite Selected
zh_cn: 未选择精灵

source: No Tile Layer Selected
zh_cn: 未选择任何图块层

source: No Tileset
zh_cn: 没有图块集

source: No User/Pass authentication details found for {0}
zh_cn: 未找到{0}的 用户/密码 身份验证详细信息

source: No Valid SSH KeyPair Authentication details found for {0}
zh_cn: 找不到 {0} 的有效的SSH密码对身份验证详细信息

source: No Valid SSH KeyPair Authentication details found for {0}\nThe repository has been successfully linked and will be able to push once valid details have been entered.
zh_cn: 没有找到{0}的有效 密钥对 身份验证详细信息\n存储库已成功链接，并且一旦输入有效详细信息就可以推送。

source: No Valid User/Pass Authentication details found for {0}
zh_cn: 找不到 {0} 的有效的用户名/密码身份验证详细信息

source: No Valid User/Pass Authentication details found for {0}\nThe repository has been successfully linked and will be able to push once valid details have been entered.
zh_cn: 没有找到{0}的有效 用户/密码 身份验证详细信息\n存储库已成功链接，并且一旦输入有效详细信息就可以推送。

source: No audio device is available for previewing sounds.
zh_cn: 没有可以预览声音的音频设备

source: No beta access
zh_cn: 没有测试版访问权

source: No changes will be saved.
zh_cn: 不会保存任何更改。

source: No connection to game
zh_cn: 没有与游戏连接

source: No library loaded.
zh_cn: 没有载入库。

source: No mac found
zh_cn: 未找到mac

source: No matter what you select, you will then be prompted to choose a save location for the project and then it will be opened in GameMaker Studio 2.
zh_cn: 无论你选择什么， 然后提示选择保存项目的位置，并在 GameMaker Studio 2中打开。

source: No new data since you last called cloud_synchronise
zh_cn: 自从上次调用以来cloud_synchronise没有新的数据。

source: No resources to add
zh_cn: 没有要添加的资源

source: No results found
zh_cn: 未找到结果

source: No results were found.
zh_cn: 查无结果

source: No rooms found - you need at least one room to run.
zh_cn: 没有房间 - 至少需要一个房间来运行

source: No tile set was selected.
zh_cn: 没有选中的图块集。

source: Node Designer ({0})
zh_cn: 节点设计器({0})

source: Node selection highlight
zh_cn: 节点选择高亮

source: Nodes
zh_cn: 节点

source: None
zh_cn: 无

source: None State
zh_cn: 无状态

source: Normal
zh_cn: 正常

source: Normal Text
zh_cn: 通常文本

source: Normal surfaces are quite easy to use, but there are a few basic rules to be followed when you use them:
zh_cn: 表面使用很简单，但在使用的时候，也有几个应遵循的基本规则：

source: Normalised Vectors
zh_cn: 规范化向量

source: Normally most instances are visible but sometimes it is useful to have invisible ones - for example, you can use them for way-points to control a moving monster, or to keep track values and perform certain timed actions.
zh_cn: 通常选择可见，但是有时不可见也是有用的。例如，可以使用点方式控制怪物移动，或者跟踪并进行一定的动作。
